// Lab4v10.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
// Создать абстрактный базовый класс «Служащий», содержащий фамилию и имя служащего. 
// Производный класс «Работники с почасовой оплатой» содержит следующие поля: 
// оплата за час и часы, отработанные за неделю. 
// Производный класс «Работники со сдельной оплатой» содержит следующие поля: 
// оплата единицы продукции и число единиц продукции за неделю. 
// Все классы должны содержать функции получения и изменения всех полей. 
// Написать программу, позволяющую получать сведения о служащих
// 
//


#include <iostream>

int main()
{
    
}

